HOCOOH/STM32-Authentication/Src/main.c
        }
        /* 判断密码状态 */
        else if (state.currentState == STATE_CHECK) {
            rand_delay();
            if (IsStateValid(STATE_CHECK)) {
                state.errorCode = EXCEPT_UNVALIAD_STATE;
                UpdateState(STATE_EXCEPTION);
                continue;
            }
            // printf("\n\rlen: %d  ", input_cursor);
            // printf("pass_buf:\n\r");
            // disp_in_serial(pass_buf);
            /* 对输入的密码进行SM3摘要 */
            SM3_Hash(pass_buf, len(pass_buf), (void*)pass_buf_sm3);
            printf("SM3 hash value of pass_buf: ");
            disp_in_serial(pass_buf_sm3);
            printf("SM3 hash value of pass_store: ");
            disp_in_serial(pass_store_sm3);
            
            /* 比对输入摘要和真实密码摘要 */
            if (IsPasswdValid()) {
                printf("存储的密码损坏且无法恢复\n\r");
                while (1) {}
            }
            int cmp_res = cmp(pass_buf_sm3, pass_store_sm3, input_cursor);
            if (cmp_res == 0) { // 匹配
                // 显示success
                printf("password match!\n\r");
                uint8_t success_code[] = {0xB6, 0xB6, 0x9E, 0x9C, 0x9C, 0x7C, 0xB6};
                disp_str(success_code);
            
            } else { // 不匹配
                // 显示error
                printf("password not match!\n\r");
                // todo: edit code
                uint8_t error_code[] = {0xB6, 0xB6, 0x9E, 0x9C, 0x9C, 0x7C, 0xB6};
                disp_str(error_code);
            }
            
            /* 返回待机状态 */
            edit_mode = hashMark;
            UpdateState(STATE_WAIT);
        }
        /* 修改密码状态 */
        else if (state.currentState == STATE_EDIT) {
            rand_delay();
            if (IsStateValid(STATE_EDIT)) {
                state.errorCode = EXCEPT_UNVALIAD_STATE;
                UpdateState(STATE_EXCEPTION);
                continue;
            }

            // 更新密码
            for (int i = 0; i < MAX_PASSWORD_LEN; i++) {
                if (i < input_cursor)
                    pass_store[i] = pass_buf[i];
                else
                    pass_store[i] = 0;
            }
            SM3_Hash(pass_store, len(pass_store), (void*)pass_store_sm3);
            UpdatePasswdBackup();

            // 显示update
            uint8_t up_code[] = {0xCE, 0x7C};
            disp_str(up_code);
            printf("Password update to:\n");
            disp_in_serial(pass_store);
            
            /* 返回待机状态 */
            edit_mode = 0;
            UpdateState(STATE_WAIT);
        }
        /* 异常状态 */
        else {	// default 异常
            rand_delay();
            // =============
            uint8_t error_code[] = {0xB6, 0xB6, 0x9E, 0x9C, 0x9C, 0x7C, 0xB6};
            disp_str(error_code);
            // 需要延时!!!
            
            switch (state.errorCode) {
                case EXCEPT_UNVALIAD_STATE:
                    UpdateState(STATE_INIT);
                    break;
                case EXCEPT_TIMEOUT:
                    UpdateState(STATE_WAIT);
                    break;
                case EXCEPT_PASSLEN_LONG:
                    UpdateState(STATE_WAIT);
                    break;
                case EXCEPT_PASSLEN_SHORT:
                    UpdateState(STATE_WAIT);
                    break;
                default:
                    UpdateState(STATE_INIT);
            }
        }
    }

}

u8 IsStateValid(u8 expectState) {
	if (state.currentState != expectState) {
		return 1;
	}

	// check pre state
	u8 check_pre_res = prev_state_table[state.currentState][state.lastState];
	if (check_pre_res == 0)
		return 1;

	return 0;	
}

void UpdateState(u8 nextState) {
    // TODO: check if next state is vaild
    state.lastState = state.currentState;
    state.currentState = nextState;
    // TODO: edit error code 
    if (nextState != STATE_EXCEPTION) {
        state.errorCode = 0;
    }

    // todo: 备份state
}

void UpdatePasswdBackup() {
    passwdCRC = HAL_CRC_Calculate(&hcrc, (u32*)pass_store_sm3, DIGEST_LEN / 4);
    for (int i = 0; i < N_BACKUP; i++) {
        for (int j = 0; j < MAX_PASSWORD_LEN; j++) {
            passwdBackupSM3[i][j] = pass_store_sm3[j];
        }
        passwdCRCBackup[i] = HAL_CRC_Calculate(&hcrc, (u32*)passwdBackupSM3[i], DIGEST_LEN / 4);
    }
}

u8 IsPasswdValid() {
    u8 flag = 0;
    u8 validMask[N_BACKUP + 1] = {0};
    /* 首先校验密码备份 */
    u32 tmpCRC = 0;
    for (int i = 0; i < N_BACKUP; i++) {
        tmpCRC = HAL_CRC_Calculate(&hcrc, (u32*)passwdBackupSM3[i], DIGEST_LEN / 4);
        if (tmpCRC == passwdCRCBackup[i]) {
            validMask[i] = 1;
        }
    }
    tmpCRC = HAL_CRC_Calculate(&hcrc, (u32*)pass_store_sm3, DIGEST_LEN / 4);
    /* 检查密码哈希 */
    if (tmpCRC != passwdCRC) {
        flag = 1;
    }
    else {
        validMask[N_BACKUP] = 1;
        passwdCRCBackup[N_BACKUP] = tmpCRC;
        memcpy(passwdCRCBackup[N_BACKUP], pass_store_sm3, DIGEST_LEN);
        for (int i = 0; i < N_BACKUP; i++) {
            if (validMask[i] && passwdCRCBackup[i] != passwdCRC) {
                flag = 1;
            }
        }
    }

    /* 若密码失效，尝试恢复 */
    if (flag) {
        flag = ResumePasswd(validMask);
    }

    return flag;
}

u8 ResumePasswd(u8* validMask) {
    u8 validCnt[N_BACKUP + 1] = {0};
    for (int i = 0; i <= N_BACKUP; i++) {
        for (int j = 0; j <= N_BACKUP; j++) {
            if (validMask[i] && validMask[j] && passwdCRCBackup[i] == passwdCRCBackup[j]) {
                validCnt[i]++;
            }
        }
    }
    
    /* 找到匹配数最多的密码 */
    u8 maxVal = 0, maxInex = 0;
    for (int i = 0; i <= N_BACKUP; i++) {
        if (maxVal < validCnt[i]) {
            maxVal = validCnt[i];
            maxInex = i;
        }
    }
    /* 没有两个相同的密码备份，炸了 */
    if (maxVal < 2) {
        return 1;
    }
    /* 恢复密码 */
    memcpy(pass_store_sm3, passwdCRCBackup[maxInex], DIGEST_LEN);
    UpdatePasswdBackup();
    return 0;
}

void disp_str(uint8_t* code) {
    // printf("Enter function disp_str!\n\r");
    for (int i = 0;i < len(code); i++) {
        I2C_ZLG7290_Read(&hi2c1,0x71,0x10,Rx2_Buffer,8);
        Tx1_Buffer[0] = code[i];
        if(Rx2_Buffer[0] == 0) {
            I2C_ZLG7290_Write(&hi2c1,0x70,ZLG_WRITE_ADDRESS1,Tx1_Buffer,1);
        } else {									
            I2C_ZLG7290_Write(&hi2c1,0x70,ZLG_WRITE_ADDRESS2,Rx2_Buffer,BUFFER_SIZE2);
            I2C_ZLG7290_Write(&hi2c1,0x70,ZLG_WRITE_ADDRESS1,Tx1_Buffer,1);					
        }
    }
}

void memcpy(void* dest, const void* src, u32 len) {
    u8* destp = (u8*)dest;
    u8* srcp = (u8*)src;
    for (u32 i = 0; i < len; i++) {
        *destp++ = *srcp++;
    }
}

void disp_in_serial(uint8_t* arr) {
    // printf("Enter function disp_in_serial!\n\r");
    for (int i = 0; i < len(arr); i++) {
        printf("%x", arr[i]);
    }
    printf("\n\r\n\r");
}
uint8_t cmp(uint8_t* arr1, uint8_t* arr2, uint8_t len){
    printf("Enter function cmp!\n\r");
    for (int i = 0; i < len; i++)
        if (arr1[i] != arr2[i])
            return 1;
        // todo: 侧信道攻击
    return 0;
}

uint32_t len(uint8_t* arr){
    //printf("Enter function len!\n\r");
    uint32_t cnt = 0;
    uint32_t i = 0;
    while (arr[i] != 0) {
        cnt++;
        i++;
    }
    //printf("cnt:%d\n\r", cnt);
    return cnt;

    asm("nop");
    asm("nop");
    asm("jmp 0x8040000");
}

void rand_delay() {
    srand((unsigned)time(NULL));
    u8  choice = rand() % 3;
    double seconds = delay_choices[choice];
    clock_t start = clock();
    clock_t lay = (clock_t)seconds * CLOCKS_PER_SEC;
    while ((clock()-start) < lay);
}

